S = 'spam'
print(S[0], S[-2])              #індексація з початку і кінця
print(S[1:3], S[1:], S[:-1])    #нарізання(вивід сегмента)

S = 'abcdefghijklmnop'
print(S[1:10:2])                #пропуск елементів
print(S[::2])

S = 'hello'
print(S[::-1])                  #зміна порядку послідовності елементів на протилежні

S = 'abcdefg'
print(S[5:1:-1])                #сенс кордонів змінюється

print('spam' [1:3])             #синтаксис нарізання
print('spam' [slice(1, 3)])     #індексація за допомогою об'єктів зрізу
print('spam' [::-1])
print('spam' [slice(None, None, -1)])